src/cf/src/Documents/ПрочиеРасходы/ПрочиеРасходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПрочиеРасходы</name>
  <registerRecords>AccumulationRegister.Убытки</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчётыСКонтрагентамиПрочие</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузочногоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерОтгрузочногоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧРасходы</name>
    <attributes>
      <name>СтатьяДДС</name>
      <type>
        <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/Enums/ХозяйственныеОперации/ХозяйственныеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ХозяйственныеОперации</name>
  <enumValues>
    <name>АвансКлиента</name>
  </enumValues>
  <enumValues>
    <name>ВозвратДенежныхСредствОтПоставщика</name>
  </enumValues>
  <enumValues>
    <name>ВозвратОплатыКлиенту</name>
  </enumValues>
  <enumValues>
    <name>ВозвратТоваровОтКлиента</name>
  </enumValues>
  <enumValues>
    <name>ВозвратТоваровПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ВыдачаДенежныхСредствВКассу</name>
  </enumValues>
  <enumValues>
    <name>ВыплатаЗарплаты</name>
  </enumValues>
  <enumValues>
    <name>ЗакупкаУПоставщика</name>
  </enumValues>
  <enumValues>
    <name>КомплектацияНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ОплатаПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеОприходование</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеСписание</name>
  </enumValues>
  <enumValues>
    <name>ПеречислениеДенежныхСредствНаБанковскийСчет</name>
  </enumValues>
  <enumValues>
    <name>ПеречислениеНалоговИВзносов</name>
  </enumValues>
  <enumValues>
    <name>ПланируемыеЦеныЗакупки</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствИзКассы</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствСБанковскогоСчета</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеОплатыОтКлиента</name>
  </enumValues>
  <enumValues>
    <name>ПродажаВКредит</name>
  </enumValues>
  <enumValues>
    <name>ПрочееПоступлениеДенежныхСредств</name>
  </enumValues>
  <enumValues>
    <name>ПрочийРасходДенежныхСредств</name>
  </enumValues>
  <enumValues>
    <name>РазукомплектацияНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>РеализацияКлиенту</name>
  </enumValues>
  <enumValues>
    <name>Сертификат</name>
  </enumValues>
  <enumValues>
    <name>СнятиеНаличныхДенежныхСредств</name>
  </enumValues>
  <enumValues>
    <name>СписаниеЗадолженности</name>
  </enumValues>
  <enumValues>
    <name>УстановкаЦенНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ОбналичиваниеЧека</name>
  </enumValues>
  <enumValues>
    <name>ОперационныеЗатраты</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
  <enumValues>
    <name>Инкассация</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Documents/ПрочиеРасходы/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	РаботаСДокументами.МожноРедактироватьДокументВФорме(Объект.Ссылка, ЭтаФорма);
	РаботаСДокументами.УстановитьЗаголовокФормыДокумента(ЭтаФорма, Объект);
	НастроитьФорму();
	УстановитьВидимостьВалюты();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Не Объект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ОперационныеЗатраты") Тогда 
		Объект.Сумма = Объект.ТЧРасходы.Итог("Сумма");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	РаботаСДокументами.УстановитьЗаголовокФормыДокумента(ЭтаФорма, ТекущийОбъект);
	УстановитьВидимостьВалюты();
КонецПроцедуры

&НаКлиенте
Процедура ХозяйственнаяОперацияПриИзменении(Элемент)
	НастроитьФорму();
КонецПроцедуры

&НаСервере
Процедура НастроитьФорму()
	ЭтоОперационныеЗатраты = Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОперационныеЗатраты;
	Элементы.Контрагент.Видимость = ЭтоОперационныеЗатраты;
	Элементы.СтатьяДДС.Видимость = ЭтоОперационныеЗатраты;
	Элементы.Сумма.Видимость = ЭтоОперационныеЗатраты;
	Элементы.ТЧРасходы.Видимость = Не ЭтоОперационныеЗатраты;
КонецПроцедуры

// Расходы в валюте (docs/plans/multicurrency-returns.md): флажок ВВалюте открывает валюту и курс, суммы - в
// валюте документа, проведение - в основной валюте по курсу.

&НаКлиенте
Процедура ВВалютеПриИзменении(Элемент)
	ВалютаПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	ВалютаПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КурсВалютыПриИзменении(Элемент)
	ПересчитатьСуммуРегл();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Если Объект.ВВалюте Тогда
		ВалютаПриИзмененииНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ВалютаПриИзмененииНаСервере()
	Если Объект.ВВалюте Тогда
		ЗаполнитьКурсНаДату();
	Иначе
		Объект.Валюта = РаботаСВалютами.ОсновнаяВалюта();
		Объект.КурсВалюты = 1;
	КонецЕсли;
	ПересчитатьСуммуРегл();
	УстановитьВидимостьВалюты();
КонецПроцедуры

// Курс валюты документа на его дату из регистра КурсыВалют; курс не задан - нулевой курс и сообщение:
// документ без курса не запишется (РаботаСВалютами.ПроверитьВалютуДокумента), пока курс не введут вручную.
//
&НаСервере
Процедура ЗаполнитьКурсНаДату()
	Курс = РаботаСВалютами.КурсВалюты(Объект.Валюта, Объект.Дата);
	Объект.КурсВалюты = Курс;
	Если Курс > 0 Или Не ЗначениеЗаполнено(Объект.Валюта) Тогда
		Возврат;
	КонецЕсли;
	Шаблон = НСтр("ru = 'Курс валюты %1 на %2 не задан (Казначейство - Курсы валют): укажите курс в документе.';
		|fr = 'Le taux de change de %1 au %2 n''est pas défini (Trésorerie - Taux de change) : indiquez le taux dans le document.';
		|en = 'The %1 exchange rate on %2 is not set (Treasury - Exchange rates): enter the rate in the document.';
		|es = 'El tipo de cambio de %1 al %2 no está definido (Tesorería - Tipos de cambio): indique el tipo en el documento.'");
	ТекстСообщения = СтрШаблон(Шаблон, Объект.Валюта, Формат(Объект.Дата, "ДЛФ=D"));
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "Объект.КурсВалюты");
КонецПроцедуры

// В модуле формы метод с &НаКлиентеНаСервере не виден ни клиенту, ни серверу (tiny1C bsl-015): только сервер.
&НаСервере
Процедура ПересчитатьСуммуРегл()
	Объект.СуммаРегл = РаботаСВалютамиКлиентСервер.СуммаРегл(Объект.Сумма, РаботаСВалютамиКлиентСервер.КурсДокумента(Объект));
КонецПроцедуры

// Доступность валюты и курса, заголовки сумм с валютой.
//
&НаСервере
Процедура УстановитьВидимостьВалюты()
	ВВалюте = Объект.ВВалюте;
	Элементы.Валюта.Доступность = ВВалюте;
	Элементы.КурсВалюты.Доступность = ВВалюте;
	ТекстСумма = НСтр("ru = 'Сумма'; fr = 'Montant'; en = 'Amount'; es = 'Importe'");
	// Пустой заголовок - заголовок по реквизиту.
	ЗаголовокСумма = ?(ВВалюте, РаботаСВалютамиКлиентСервер.ЗаголовокСВалютой(ТекстСумма, Объект.Валюта), "");
	Элементы.Сумма.Заголовок = ЗаголовокСумма;
	Элементы.ТЧРасходыСумма.Заголовок = ЗаголовокСумма;
КонецПроцедуры
